In [3]:
import pandas as pd
s=pd.Series([1,2,3,4,5])
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
# creating a series from ndarry
import numpy as np
data=np.array(['a','b','c','d'])
s=pd.Series(data,index=[100,101,102,'indexd'])
print(s)

100       a
101       b
102       c
indexd    d
dtype: object

In [8]:
# creating a series from dictionary
data={'a':0,'b':1,'c': 2}
s=pd.Series(data,index=['b','c','d','a'])
print(s)

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [9]:
# creating a series from scalar
s=pd.Series(5,index=[0,1,2,3])
print(s)

0    5
1    5
2    5
3    5
dtype: int64

In [40]:
s=pd.Series(10, index=[1,1,1,1])
print(s)
s[1]

1    10
1    10
1    10
1    10
dtype: int64

1    10
1    10
1    10
1    10
dtype: int64

In [15]:
popu={'amritsar':500,'jalandhar':200,'ludhiana':700}
population=pd.Series(popu)
population

amritsar     500
jalandhar    200
ludhiana     700
dtype: int64

In [16]:
population['ludhiana']

700

In [17]:
population['amritsar':'ludhiana']

amritsar     500
jalandhar    200
ludhiana     700
dtype: int64

In [18]:
population['amritsar':]

amritsar     500
jalandhar    200
ludhiana     700
dtype: int64

In [19]:
population[:'ludhiana']

amritsar     500
jalandhar    200
ludhiana     700
dtype: int64

In [21]:
population[:]

amritsar     500
jalandhar    200
ludhiana     700
dtype: int64

In [22]:
population[::2]

amritsar    500
ludhiana    700
dtype: int64

In [23]:
df=pd.DataFrame()

In [25]:
data=[1,2,3,4,5]
df=pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [28]:
data=[['amit',10],['sumit',12],['himmat',13]]
df=pd.DataFrame(data,columns=['name','fees'],dtype=float)
df

C:\Users\GOD\AppData\Local\Temp\ipykernel_1200\3774025390.py:2: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df=pd.DataFrame(data,columns=['name','fees'],dtype=float)

     name  fees
0    amit  10.0
1   sumit  12.0
2  himmat  13.0

In [31]:
data={'name':['A','B','C','D'],'age':[10,11,12,15]}
df=pd.DataFrame(data)
df

  name  age
0    A   10
1    B   11
2    C   12
3    D   15

In [32]:
data={'name':['A','B','C','D'],'age':[10,11,12,15]}
df=pd.DataFrame(data,index=['rank1','rank2','rank3','rank4'])
df

      name  age
rank1    A   10
rank2    B   11
rank3    C   12
rank4    D   15

In [34]:
data=[{'a':1,'b':2},{'a':5,'b':10,'c':20}]
df=pd.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [36]:
data=[{'a':i,'b':2*i}for i in range(3)]
df=pd.DataFrame(data)
df

   a  b
0  0  0
1  1  2
2  2  4